In [5]:
# importing library

import pandas as pd

In [6]:
# loading dataset

data = pd.read_csv('C:\\Users\\Admin\\Internshala\\SpreadOfData_dataset.csv')

In [7]:
# print 5 rows

data.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [9]:
# Calculate the max value of a column by using max() function. 

max_data = data['Overall Marks'].max()

In [10]:
print(max_data)

9700

In [11]:
# Calculate the min value of a column by using min() function. 

min_data = data['Overall Marks'].min()

In [12]:
print(min_data)

0

In [13]:
# Find the Range

range_data = max_data - min_data

In [14]:
print(range_data)

9700

In [19]:
# Calculating IQR requires calculating 1st and 3rd quartiles.

Q1 = data['Overall Marks'].quantile(0.25)
Q3 = data['Overall Marks'].quantile(0.75)

In [20]:
# print Q1 and Q2 values 

print(Q1)
print(Q3)

57.25
87.25

In [21]:
# Find IQR 

IQR = Q3 - Q1

In [22]:
# print IQR

print(IQR)

30.0

What is the range of the following times?
[2.9hrs, 10.3hrs, 5.5hrs, 2.1hrs, 3.9hrs]

In [24]:
# range = max - min

10.3 - 2.1

8.200000000000001

What is the 3rd quartile of the dataset?
37,42,48,51,52,53,54,54,55

In [25]:
data = [37,42,48,51,52,53,54,54,55]

In [26]:
Q3 = data.quantile(0.75)

AttributeError: 'list' object has no attribute 'quantile'

Note:
    We can only find the quantile with column name.

Here median is, 52. In the right quartile we have 53,54,54,55. Therefore median of third quartile is (54+54)/2=54.